is1200-example-projects/mcb32tools/headers/proc/p32mz2048ecg124.h
extern volatile __AD1DATA2bits_t AD1DATA2bits __asm__ ("AD1DATA2") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA3 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA3bits_t;
extern volatile __AD1DATA3bits_t AD1DATA3bits __asm__ ("AD1DATA3") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA4 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA4bits_t;
extern volatile __AD1DATA4bits_t AD1DATA4bits __asm__ ("AD1DATA4") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA5 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA5bits_t;
extern volatile __AD1DATA5bits_t AD1DATA5bits __asm__ ("AD1DATA5") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA6 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA6bits_t;
extern volatile __AD1DATA6bits_t AD1DATA6bits __asm__ ("AD1DATA6") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA7 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA7bits_t;
extern volatile __AD1DATA7bits_t AD1DATA7bits __asm__ ("AD1DATA7") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA8 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA8bits_t;
extern volatile __AD1DATA8bits_t AD1DATA8bits __asm__ ("AD1DATA8") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA9 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA9bits_t;
extern volatile __AD1DATA9bits_t AD1DATA9bits __asm__ ("AD1DATA9") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA10 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA10bits_t;
extern volatile __AD1DATA10bits_t AD1DATA10bits __asm__ ("AD1DATA10") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA11 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA11bits_t;
extern volatile __AD1DATA11bits_t AD1DATA11bits __asm__ ("AD1DATA11") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA12 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA12bits_t;
extern volatile __AD1DATA12bits_t AD1DATA12bits __asm__ ("AD1DATA12") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA13 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA13bits_t;
extern volatile __AD1DATA13bits_t AD1DATA13bits __asm__ ("AD1DATA13") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA14 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA14bits_t;
extern volatile __AD1DATA14bits_t AD1DATA14bits __asm__ ("AD1DATA14") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA15 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA15bits_t;
extern volatile __AD1DATA15bits_t AD1DATA15bits __asm__ ("AD1DATA15") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA16 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA16bits_t;
extern volatile __AD1DATA16bits_t AD1DATA16bits __asm__ ("AD1DATA16") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA17 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA17bits_t;
extern volatile __AD1DATA17bits_t AD1DATA17bits __asm__ ("AD1DATA17") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA18 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA18bits_t;
extern volatile __AD1DATA18bits_t AD1DATA18bits __asm__ ("AD1DATA18") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA19 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA19bits_t;
extern volatile __AD1DATA19bits_t AD1DATA19bits __asm__ ("AD1DATA19") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA20 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA20bits_t;
extern volatile __AD1DATA20bits_t AD1DATA20bits __asm__ ("AD1DATA20") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA21 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA21bits_t;
extern volatile __AD1DATA21bits_t AD1DATA21bits __asm__ ("AD1DATA21") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA22 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA22bits_t;
extern volatile __AD1DATA22bits_t AD1DATA22bits __asm__ ("AD1DATA22") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA23 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA23bits_t;
extern volatile __AD1DATA23bits_t AD1DATA23bits __asm__ ("AD1DATA23") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA24 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA24bits_t;
extern volatile __AD1DATA24bits_t AD1DATA24bits __asm__ ("AD1DATA24") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA25 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA25bits_t;
extern volatile __AD1DATA25bits_t AD1DATA25bits __asm__ ("AD1DATA25") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA26 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA26bits_t;
extern volatile __AD1DATA26bits_t AD1DATA26bits __asm__ ("AD1DATA26") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA27 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA27bits_t;
extern volatile __AD1DATA27bits_t AD1DATA27bits __asm__ ("AD1DATA27") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA28 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA28bits_t;
extern volatile __AD1DATA28bits_t AD1DATA28bits __asm__ ("AD1DATA28") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA29 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA29bits_t;
extern volatile __AD1DATA29bits_t AD1DATA29bits __asm__ ("AD1DATA29") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA30 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA30bits_t;
extern volatile __AD1DATA30bits_t AD1DATA30bits __asm__ ("AD1DATA30") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA31 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA31bits_t;
extern volatile __AD1DATA31bits_t AD1DATA31bits __asm__ ("AD1DATA31") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA32 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA32bits_t;
extern volatile __AD1DATA32bits_t AD1DATA32bits __asm__ ("AD1DATA32") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA33 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA33bits_t;
extern volatile __AD1DATA33bits_t AD1DATA33bits __asm__ ("AD1DATA33") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA34 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA34bits_t;
extern volatile __AD1DATA34bits_t AD1DATA34bits __asm__ ("AD1DATA34") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA35 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA35bits_t;
extern volatile __AD1DATA35bits_t AD1DATA35bits __asm__ ("AD1DATA35") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA36 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA36bits_t;
extern volatile __AD1DATA36bits_t AD1DATA36bits __asm__ ("AD1DATA36") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA37 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA37bits_t;
extern volatile __AD1DATA37bits_t AD1DATA37bits __asm__ ("AD1DATA37") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA38 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA38bits_t;
extern volatile __AD1DATA38bits_t AD1DATA38bits __asm__ ("AD1DATA38") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA39 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA39bits_t;
