is1200-example-projects/mcb32tools/headers/proc/p32mz2048ecg124.h
#define _USBE1RXA_RXFADDR_POSITION               0x00000000
#define _USBE1RXA_RXFADDR_MASK                   0x0000007F
#define _USBE1RXA_RXFADDR_LENGTH                 0x00000007

#define _USBE1RXA_RXHUBADD_POSITION              0x00000010
#define _USBE1RXA_RXHUBADD_MASK                  0x007F0000
#define _USBE1RXA_RXHUBADD_LENGTH                0x00000007

#define _USBE1RXA_MULTTRAN_POSITION              0x00000017
#define _USBE1RXA_MULTTRAN_MASK                  0x00800000
#define _USBE1RXA_MULTTRAN_LENGTH                0x00000001

#define _USBE1RXA_RXHUBPRT_POSITION              0x00000018
#define _USBE1RXA_RXHUBPRT_MASK                  0x7F000000
#define _USBE1RXA_RXHUBPRT_LENGTH                0x00000007

#define _USBE2TXA_TXFADDR_POSITION               0x00000000
#define _USBE2TXA_TXFADDR_MASK                   0x0000007F
#define _USBE2TXA_TXFADDR_LENGTH                 0x00000007

#define _USBE2TXA_TXHUBADD_POSITION              0x00000010
#define _USBE2TXA_TXHUBADD_MASK                  0x007F0000
#define _USBE2TXA_TXHUBADD_LENGTH                0x00000007

#define _USBE2TXA_MULTTRAN_POSITION              0x00000017
#define _USBE2TXA_MULTTRAN_MASK                  0x00800000
#define _USBE2TXA_MULTTRAN_LENGTH                0x00000001

#define _USBE2TXA_TXHUBPRT_POSITION              0x00000018
#define _USBE2TXA_TXHUBPRT_MASK                  0x7F000000
#define _USBE2TXA_TXHUBPRT_LENGTH                0x00000007

#define _USBE2RXA_RXFADDR_POSITION               0x00000000
#define _USBE2RXA_RXFADDR_MASK                   0x0000007F
#define _USBE2RXA_RXFADDR_LENGTH                 0x00000007

#define _USBE2RXA_RXHUBADD_POSITION              0x00000010
#define _USBE2RXA_RXHUBADD_MASK                  0x007F0000
#define _USBE2RXA_RXHUBADD_LENGTH                0x00000007

#define _USBE2RXA_MULTTRAN_POSITION              0x00000017
#define _USBE2RXA_MULTTRAN_MASK                  0x00800000
#define _USBE2RXA_MULTTRAN_LENGTH                0x00000001

#define _USBE2RXA_RXHUBPRT_POSITION              0x00000018
#define _USBE2RXA_RXHUBPRT_MASK                  0x7F000000
#define _USBE2RXA_RXHUBPRT_LENGTH                0x00000007

#define _USBE3TXA_TXFADDR_POSITION               0x00000000
#define _USBE3TXA_TXFADDR_MASK                   0x0000007F
#define _USBE3TXA_TXFADDR_LENGTH                 0x00000007

#define _USBE3TXA_TXHUBADD_POSITION              0x00000010
#define _USBE3TXA_TXHUBADD_MASK                  0x007F0000
#define _USBE3TXA_TXHUBADD_LENGTH                0x00000007

#define _USBE3TXA_MULTTRAN_POSITION              0x00000017
#define _USBE3TXA_MULTTRAN_MASK                  0x00800000
#define _USBE3TXA_MULTTRAN_LENGTH                0x00000001

#define _USBE3TXA_TXHUBPRT_POSITION              0x00000018
#define _USBE3TXA_TXHUBPRT_MASK                  0x7F000000
#define _USBE3TXA_TXHUBPRT_LENGTH                0x00000007

#define _USBE3RXA_RXFADDR_POSITION               0x00000000
#define _USBE3RXA_RXFADDR_MASK                   0x0000007F
#define _USBE3RXA_RXFADDR_LENGTH                 0x00000007

#define _USBE3RXA_RXHUBADD_POSITION              0x00000010
#define _USBE3RXA_RXHUBADD_MASK                  0x007F0000
#define _USBE3RXA_RXHUBADD_LENGTH                0x00000007

#define _USBE3RXA_MULTTRAN_POSITION              0x00000017
#define _USBE3RXA_MULTTRAN_MASK                  0x00800000
#define _USBE3RXA_MULTTRAN_LENGTH                0x00000001

#define _USBE3RXA_RXHUBPRT_POSITION              0x00000018
#define _USBE3RXA_RXHUBPRT_MASK                  0x7F000000
#define _USBE3RXA_RXHUBPRT_LENGTH                0x00000007

#define _USBE4TXA_TXFADDR_POSITION               0x00000000
#define _USBE4TXA_TXFADDR_MASK                   0x0000007F
#define _USBE4TXA_TXFADDR_LENGTH                 0x00000007

#define _USBE4TXA_TXHUBADD_POSITION              0x00000010
#define _USBE4TXA_TXHUBADD_MASK                  0x007F0000
#define _USBE4TXA_TXHUBADD_LENGTH                0x00000007

#define _USBE4TXA_MULTTRAN_POSITION              0x00000017
#define _USBE4TXA_MULTTRAN_MASK                  0x00800000
#define _USBE4TXA_MULTTRAN_LENGTH                0x00000001

#define _USBE4TXA_TXHUBPRT_POSITION              0x00000018
#define _USBE4TXA_TXHUBPRT_MASK                  0x7F000000
#define _USBE4TXA_TXHUBPRT_LENGTH                0x00000007

#define _USBE4RXA_RXFADDR_POSITION               0x00000000
#define _USBE4RXA_RXFADDR_MASK                   0x0000007F
#define _USBE4RXA_RXFADDR_LENGTH                 0x00000007

#define _USBE4RXA_RXHUBADD_POSITION              0x00000010
#define _USBE4RXA_RXHUBADD_MASK                  0x007F0000
#define _USBE4RXA_RXHUBADD_LENGTH                0x00000007

#define _USBE4RXA_MULTTRAN_POSITION              0x00000017
#define _USBE4RXA_MULTTRAN_MASK                  0x00800000
#define _USBE4RXA_MULTTRAN_LENGTH                0x00000001

#define _USBE4RXA_RXHUBPRT_POSITION              0x00000018
#define _USBE4RXA_RXHUBPRT_MASK                  0x7F000000
#define _USBE4RXA_RXHUBPRT_LENGTH                0x00000007

#define _USBE5TXA_TXFADDR_POSITION               0x00000000
#define _USBE5TXA_TXFADDR_MASK                   0x0000007F
#define _USBE5TXA_TXFADDR_LENGTH                 0x00000007

#define _USBE5TXA_TXHUBADD_POSITION              0x00000010
#define _USBE5TXA_TXHUBADD_MASK                  0x007F0000
#define _USBE5TXA_TXHUBADD_LENGTH                0x00000007

#define _USBE5TXA_MULTTRAN_POSITION              0x00000017
#define _USBE5TXA_MULTTRAN_MASK                  0x00800000
#define _USBE5TXA_MULTTRAN_LENGTH                0x00000001

#define _USBE5TXA_TXHUBPRT_POSITION              0x00000018
#define _USBE5TXA_TXHUBPRT_MASK                  0x7F000000
#define _USBE5TXA_TXHUBPRT_LENGTH                0x00000007

#define _USBE5RXA_RXFADDR_POSITION               0x00000000
#define _USBE5RXA_RXFADDR_MASK                   0x0000007F
#define _USBE5RXA_RXFADDR_LENGTH                 0x00000007

#define _USBE5RXA_RXHUBADD_POSITION              0x00000010
#define _USBE5RXA_RXHUBADD_MASK                  0x007F0000
#define _USBE5RXA_RXHUBADD_LENGTH                0x00000007

#define _USBE5RXA_MULTTRAN_POSITION              0x00000017
#define _USBE5RXA_MULTTRAN_MASK                  0x00800000
#define _USBE5RXA_MULTTRAN_LENGTH                0x00000001

